@myc2h6o With 3.54.0 I get no error; my azurerm_recovery_services_vault is created with Zone Redundancy. I have:
```
resource "azurerm_recovery_services_vault" "recovery_services_vault" {
  name                = "${var.customer_name}FileShareBackupVault"
  location            = var.location
  resource_group_name = var.resource_group_name
  sku                 = "Standard"
  storage_mode_type   = "ZoneRedundant"
  cross_region_restore_enabled = false
  
  tags = {
    ManagedByTerraform = true
  }
}
```
which results in
```
 # module.customer.module.rsv.azurerm_recovery_services_vault.recovery_services_vault will be created
  + resource "azurerm_recovery_services_vault" "recovery_services_vault" {
      + classic_vmware_replication_enabled = (known after apply)
      + cross_region_restore_enabled       = false
      + id                                 = (known after apply)
      + immutability                       = (known after apply)
      + location                           = "uksouth"
      + name                               = "testFileShareBackupVault"
      + public_network_access_enabled      = true
      + resource_group_name                = "test"
      + sku                                = "Standard"
      + soft_delete_enabled                = true
      + storage_mode_type                  = "ZoneRedundant"
      + tags                               = {
          + "ManagedByTerraform" = "true"
        }
    }
```
which works with 3.54.0.
Before this week I had neither `storage_mode_type` nor `cross_region_restore_enabled` in my Terraform code and it was working, though I am uncertain if the result was ZRS or GRS mode. I don't know at what point I started using AzureRM 3.55; that was automatic.
Sorry for any vagueness; I have only just started using Terraform and I cannot tell if my issue has the same underlying cause as the original post.